app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `messages`
---
  def index
    @messages = Message.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `messages` (`body`, `user_id`, `created_at`, `updated_at`) VALUES ('tttt', 1, '2019-05-30 03:47:10', '2019-05-30 03:47:10')
---
  def create
    Message.create(body: message_params[:body], user_id: current_user.id)

SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 13 LIMIT 1
DELETE FROM `messages` WHERE `messages`.`id` = 13
---
  def destroy
    message = Message.find(params[:id])
    message.destroy if message.user_id == current_user.id

SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 10 LIMIT 1
---
  def edit
    @message = Message.find(params[:id])

SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 10 LIMIT 1
UPDATE `messages` SET `body` = 'qqqq', `updated_at` = '2019-05-30 04:00:41' WHERE `messages`.`id` = 11
---
  def update
    message = Message.find(params[:id])
    if message.user_id == current_user.id
     message.update(message_params)